БИТУправление_медицинским_центром_демо/src/Catalogs/УпаковкиМаркируемогоТовара/УпаковкиМаркируемогоТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиМаркируемогоТовара</name>
  <attributes>
    <name>НомерУпаковки</name>
    <type>
      <types>DefinedType.НомерУпаковкиМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияНоменклатуры</name>
    <type>
      <types>DefinedType.СерияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоденДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/CommonModules/ИнтеграцияМДЛПВызовСервера_БИТ/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьGTIN(Номенклатура, СерияНоменклатуры = Неопределено) Экспорт
	
	НаборGTIN	= Новый Массив();
	Запрос		= Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПОДСТРОКА(УпаковкиМаркируемогоТовара.НомерУпаковки, 1, 14) КАК GTIN
		|ПОМЕСТИТЬ Таблица
		|ИЗ
		|	Справочник.УпаковкиМаркируемогоТовара КАК УпаковкиМаркируемогоТовара
		|ГДЕ
		|	УпаковкиМаркируемогоТовара.Номенклатура = &Номенклатура
		|	И (&НеИспользоватьОтборПоСерии
		|			ИЛИ УпаковкиМаркируемогоТовара.СерияНоменклатуры = &СерияНоменклатуры)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таблица.GTIN КАК GTIN
		|ИЗ
		|	Таблица КАК Таблица";
	
	Запрос.УстановитьПараметр("НеИспользоватьОтборПоСерии", НЕ ЗначениеЗаполнено(СерияНоменклатуры));
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СерияНоменклатуры", СерияНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборGTIN.Добавить(ВыборкаДетальныеЗаписи.GTIN);
	КонецЦикла;
	
	Возврат НаборGTIN;
	
КонецФункции

Функция ВедетсяУчетМДЛП() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("ВестиСведенияДляМониторингаДвиженияЛекарственныхПрепаратов");
КонецФункции

Функция ПолучитьПериодВыполненияОбменаМДЛП() Экспорт
	ПериодОбмена = Константы.ПериодВыполненияОбменаДаннымиМДЛП.Получить();
	Если ПериодОбмена = 0 Тогда
		ПериодОбмена = 60;
	КонецЕсли;
	
	Возврат ПериодОбмена;
КонецФункции

#КонецОбласти
